# Даны два неупорядоченных набора целых чисел (может быть, с повторениями). 
# Выдать без повторений в порядке возрастания все те числа, которые встречаются в обоих наборах.
# Пользователь вводит 2 числа. n — кол-во элементов первого множества. m — кол-во элементов второго множества. 
# Затем пользователь вводит сами элементы множеств.

n = int(input("Введите длину первого множества: "))
m = int(input("Введите длину второго множества: "))
# x=int(input("Введите максимальное значение числа в списке: "))
# import random
# num_1=[]
# for i in range(n):
#     num_1.append(random.randint(1,x))
# num_2=[]
# for i in range(n):
#     num_2.append(random.randint(1,x))
# print(num_1)
# print(num_2)

# print(num_all)


#  Я не смог решить.

